# LightingDevice Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightingDevice Class
Members See Also
---
Provides access to the Lighting Device in Autodesk Revit MEP.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class LightingDevice : MEPModel
```

Visual Basic
---
```text
Public Class LightingDevice _
	Inherits MEPModel
```

Visual C++
---
```text
public ref class LightingDevice : public MEPModel
```

# Remarks
The Lighting Device object can only be queried in Autodesk Revit MEP.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..MEPModel Autodesk.Revit.DB.Electrical..::..LightingDevice
# See Also
LightingDevice Members
Autodesk.Revit.DB.Electrical Namespace